zmsqp/mouse-bridge-ch32/User/mouse_bridge.c
#include "mouse_bridge.h"
#include "bridge_debug.h"
#include "usb_bridge_config.h"
#include "bridge_time.h"
#include "bridge_flash.h"
#include "led_indicator.h"
#include "stdio.h"
#include "string.h"

#define MOUSE_BRIDGE_VERBOSE_LAYOUT  0
#define MOUSE_BRIDGE_STATUS_UART     1
#define MOUSE_BRIDGE_RAW_QUEUE_SIZE  64U

#if (USB_PC_PORT == USB_PC_PORT_USBFS)
#include "ch32v20x_usbfs_device.h"
#include "usbfs_desc.h"
#else
#include "usb_desc.h"
#include "usb_lib.h"
#include "usb_pwr.h"
#include "usb_prop.h"

extern uint8_t USBD_Endp1_Busy;
extern uint8_t USBD_Endp2_Busy;
extern uint8_t USBD_ENDPx_DataUp(uint8_t endp, uint8_t *pbuf, uint16_t len);
#endif

static MouseBridgeConfig g_cfg;
static MouseBridgeConfig g_profiles[MOUSE_BRIDGE_PROFILE_COUNT];
static uint8_t g_profile_valid_mask;
static uint8_t g_selected_profile;

/* Host 接收器端点包长（可为 64）；PC 侧 USBD 鼠标描述符固定 4 字节 */
static uint16_t g_host_ep_max = 4;
#if (USB_PC_PORT == USB_PC_PORT_USBFS)
static uint16_t g_pc_ep_max = 4;
#else
static uint16_t g_pc_ep_max = DEF_ENDP_SIZE_INJECT;
#endif

/* 从 HID 描述符解析出的鼠标 Input 报告布局（payload，不含 Report ID 前缀字节） */
typedef struct
{
    uint8_t  report_id;
    uint8_t  has_report_id;
    uint16_t btn_bit;
    uint8_t  btn_count;
    uint16_t x_bit;
    uint8_t  x_size;
    uint16_t y_bit;
    uint8_t  y_size;
    uint16_t wheel_bit;
    uint8_t  wheel_size;
    uint8_t  payload_len;  /* 最短 payload 字节数 */
} MouseReportLayout;

static MouseReportLayout g_layout;

/* 位移累加池：USB 忙时只累加计数，发送后再扣减，避免双缓冲覆盖丢手 */
static int16_t g_motion_dx;
static int16_t g_motion_dy;
static uint8_t g_out_buttons;
static int16_t g_out_wheel;
static uint8_t g_last_sent_buttons;
static uint8_t g_motion_dirty;
static uint8_t g_pending_wheel_reports;

#define RECOIL_INJECT_INTERVAL_MS  2U
#define PRIMARY_BUTTON_MASK        0x07U
#define BUTTON_LEFT_MASK           0x01U
#define BUTTON_RIGHT_MASK          0x02U
#define BUTTON_MIDDLE_MASK         0x04U
#define BUTTON_REAR_MASK           0x08U
#define BUTTON_FRONT_MASK          0x10U
#define AIM_TOGGLE_DEFAULT_MASK    0x10U
#define AIM_TOGGLE_DEBOUNCE_MS     180U

static uint8_t g_aim_btn_was_down;
static uint8_t g_aim_button_mask;
static uint8_t g_control_prev_buttons;
static uint8_t g_suppressed_buttons;
static uint32_t g_last_aim_toggle_ms;
static uint8_t g_current_buttons;
static uint8_t g_forward_buttons;
static uint8_t g_lbtn_was_down;
static uint32_t g_lbtn_down_ms;
static int16_t g_dx_accum_x100;
static int16_t g_dy_accum_x100;
/* Compensation accepted by the motion endpoint but not sent yet. */
static int16_t g_pending_inject_dx;
static int16_t g_pending_inject_dy;
/* Compensation that has actually reached the PC in this firing session. */
static int16_t g_session_inject_dx;
static int16_t g_session_inject_dy;
static uint32_t g_recoil_start_ms;
static uint8_t g_recoil_stage_index;
static uint8_t g_springback_active;
static uint8_t g_recoil_exhausted;
static MouseBridgeStage g_zero_stage;
static uint32_t g_stream_last_ms;
static uint32_t g_last_inject_ms;
static uint8_t g_inject_div;
static uint8_t g_raw_debug;
static uint8_t g_raw_last_buttons;
static uint8_t g_raw_drop_seen;
static uint8_t g_raw_last_fail0;
static uint8_t g_raw_queue[MOUSE_BRIDGE_RAW_QUEUE_SIZE][MOUSE_BRIDGE_REPORT_MAX];
static uint16_t g_raw_queue_len[MOUSE_BRIDGE_RAW_QUEUE_SIZE];
static uint8_t g_raw_q_read;
static uint8_t g_raw_q_write;
static uint8_t g_raw_q_count;
static void MouseBridge_TryFlush(void);
static void MouseBridge_TryFlushRaw(void);
static void MouseBridge_TryForwardRaw(const uint8_t *data, uint16_t len);
static void MouseBridge_AccumMotion(int16_t dx, int16_t dy, uint8_t buttons, int8_t wheel, uint8_t update_wheel);
static int8_t MouseBridge_ClampAxis(int16_t value);
static void MouseBridge_ApplyDefaultLayout(void);
static void MouseBridge_ParseReportLayout(const uint8_t *desc, uint16_t len);
static uint8_t MouseBridge_ExtractReport(const uint8_t *raw, uint16_t raw_len,
                                           uint8_t *btn, int16_t *dx, int16_t *dy, int8_t *wheel);
static uint8_t MouseBridge_ExtractButtons(const uint8_t *raw, uint16_t raw_len, uint8_t *btn);
static uint8_t MouseBridge_ExtractBootPayload(const uint8_t *payload, uint16_t plen,
                                              uint8_t *btn, int16_t *dx, int16_t *dy, int8_t *wheel);
static uint32_t MouseBridge_ReadBits(const uint8_t *p, uint16_t plen, uint16_t bit, uint8_t size);
static int16_t MouseBridge_ReadSignedBits(const uint8_t *p, uint16_t plen, uint16_t bit, uint8_t size);
static void MouseBridge_ResetRecoilAccum(void);
static void MouseBridge_DropPendingInject(void);
static void MouseBridge_CancelSpringback(void);
static void MouseBridge_ResetRecoilSession(void);
static void MouseBridge_StartSpringback(void);
static void MouseBridge_TickSpringback(void);
static const MouseBridgeStage *MouseBridge_CurrentStage(void);
static void MouseBridge_LogRawReport(const uint8_t *data, uint16_t len,
                                     uint8_t parsed, uint8_t buttons,
                                     int16_t dx, int16_t dy, int8_t wheel);
static void MouseBridge_UpdateLed(void);
static uint8_t MouseBridge_SelectProfileInternal(uint8_t profile_id, uint8_t notify);
static void MouseBridge_ScrubControlReport(uint8_t *raw, uint16_t raw_len,
                                           uint8_t buttons, int8_t wheel);

static int16_t MouseBridge_RoundX100ToX10(int16_t value)
{
    if(value >= 0)
    {
        return (int16_t)((value + 5) / 10);
    }
    return (int16_t)((value - 5) / 10);
}

static void MouseBridge_NotifyAimChange(void)
{
#if MOUSE_BRIDGE_STATUS_UART
    printf("@A,%u\r\n", (unsigned)g_cfg.aim_active);
#else
    if(!g_cfg.monitor_stream)
    {
        return;
    }

    printf("@A,%u\r\n", (unsigned)g_cfg.aim_active);
#endif
}

static void MouseBridge_NotifyHotkeyChange(void)
{
#if MOUSE_BRIDGE_STATUS_UART
    printf("@H,%u\r\n", (unsigned)g_cfg.hotkey_active);
#else
    if(!g_cfg.monitor_stream)
    {
        return;
    }

    printf("@H,%u\r\n", (unsigned)g_cfg.hotkey_active);
#endif
    g_stream_last_ms = 0;
}

static void MouseBridge_NotifyProfileChange(void)
{
#if MOUSE_BRIDGE_STATUS_UART
    printf("@G,%u,%u\r\n", (unsigned)g_selected_profile,
           (unsigned)g_profile_valid_mask);
#endif
}

