zmsqp/mouse-bridge-ch32/User/mouse_bridge.c
static void MouseBridge_UpdateLed(void)
{
    if(!g_cfg.enabled || !g_cfg.aim_active)
    {
        LED_Indicator_SetMode(LED_INDICATOR_OFF);
    }
    else if(g_cfg.hotkey_active)
    {
        LED_Indicator_SetMode(LED_INDICATOR_FAST);
    }
    else
    {
        LED_Indicator_SetMode(LED_INDICATOR_ON);
    }
}

static void MouseBridge_LogRawReport(const uint8_t *data, uint16_t len,
                                     uint8_t parsed, uint8_t buttons,
                                     int16_t dx, int16_t dy, int8_t wheel)
{
    uint16_t i;
    uint16_t show;

    if(!g_raw_debug)
    {
        return;
    }
    if(parsed)
    {
        if(buttons == g_raw_last_buttons)
        {
            return;
        }
        g_raw_last_buttons = buttons;
    }
    else
    {
        uint8_t fail0 = (data != 0 && len > 0U) ? data[0] : 0U;
        if(g_raw_drop_seen && fail0 == g_raw_last_fail0)
        {
            return;
        }
        g_raw_drop_seen = 1U;
        g_raw_last_fail0 = fail0;
    }

    show = (len > 12U) ? 12U : len;
    printf("@R,%u,%u,%u,%d,%d,%d,%u,",
           (unsigned)parsed,
           (unsigned)buttons,
           (unsigned)g_aim_button_mask,
           (int)dx,
           (int)dy,
           (int)wheel,
           (unsigned)len);
    for(i = 0; i < show; i++)
    {
        printf("%02X", data[i]);
        if(i + 1U < show)
        {
            printf(" ");
        }
    }
    printf("\r\n");
}

void MouseBridge_Init(void)
{
    uint8_t default_profile = MOUSE_BRIDGE_GUN_AK;

    g_aim_btn_was_down = 0;
    g_aim_button_mask = AIM_TOGGLE_DEFAULT_MASK;
    g_control_prev_buttons = 0U;
    g_suppressed_buttons = 0U;
    g_last_aim_toggle_ms = 0;
    g_motion_dx = 0;
    g_motion_dy = 0;
    g_out_buttons = 0;
    g_out_wheel = 0;
    g_last_sent_buttons = 0xFFU;
    g_motion_dirty = 0;
    g_pending_wheel_reports = 0;
    g_current_buttons = 0;
    g_forward_buttons = 0;
    g_lbtn_was_down = 0;
    g_lbtn_down_ms = 0;
    g_dx_accum_x100 = 0;
    g_dy_accum_x100 = 0;
    g_pending_inject_dx = 0;
    g_pending_inject_dy = 0;
    g_session_inject_dx = 0;
    g_session_inject_dy = 0;
    g_recoil_start_ms = 0;
    g_recoil_stage_index = 0;
    g_springback_active = 0;
    g_recoil_exhausted = 0;
    g_zero_stage.duration_ms = 0U;
    g_zero_stage.dx_x100 = 0;
    g_zero_stage.dy_x100 = 0;
    g_last_inject_ms = 0;
    g_inject_div = 0;
    g_raw_debug = 0;
    g_raw_last_buttons = 0xFFU;
    g_raw_drop_seen = 0;
    g_raw_last_fail0 = 0xFFU;
    g_raw_q_read = 0;
    g_raw_q_write = 0;
    g_raw_q_count = 0;
    BridgeFlash_LoadBank(g_profiles, &g_profile_valid_mask, &default_profile);
    g_selected_profile = default_profile;
    memcpy(&g_cfg, &g_profiles[g_selected_profile], sizeof(g_cfg));
    /* Returning to the firing anchor is a required safety invariant. */
    g_cfg.recoil_springback = 1U;
    MouseBridge_ApplyDefaultLayout();
#if (USB_PC_PORT == USB_PC_PORT_USBD)
    USBD_LoadDefaultReportDescriptor();
#endif
    g_cfg.hotkey_active = 0;
    g_cfg.aim_active = 0;
    g_cfg.monitor_stream = 0;
    MouseBridge_UpdateLed();

#if (USB_PC_PORT == USB_PC_PORT_USBFS)
    USBFS_LoadDefaultReportDescriptor();
#endif
}

void MouseBridge_TickMs(void)
{
}

void MouseBridge_GetLiveState(MouseBridgeLiveState *state)
{
    if(state == 0)
    {
        return;
    }

    state->aim_active = g_cfg.aim_active;
    state->recoil_active = g_cfg.hotkey_active;
    state->buttons = g_current_buttons;
    state->selected_profile = g_selected_profile;
    state->profile_valid_mask = g_profile_valid_mask;
}

MouseBridgeConfig *MouseBridge_GetConfig(void)
{
    return &g_cfg;
}

uint8_t MouseBridge_GetSelectedProfile(void)
{
    return g_selected_profile;
}

uint8_t MouseBridge_GetProfileValidMask(void)
{
    return g_profile_valid_mask;
}

void MouseBridge_ProfileBegin(void)
{
    if(g_session_inject_dx != 0 || g_session_inject_dy != 0 ||
       g_pending_inject_dx != 0 || g_pending_inject_dy != 0)
    {
        MouseBridge_StartSpringback();
    }
    else
    {
        MouseBridge_ResetRecoilSession();
    }
    g_cfg.hotkey_active = 0U;
    g_cfg.aim_active = 0U;
    g_profile_valid_mask = 0U;
    MouseBridge_UpdateLed();
}

uint8_t MouseBridge_ProfileStore(uint8_t profile_id)
{
    if(profile_id >= MOUSE_BRIDGE_PROFILE_COUNT)
    {
        return 0U;
    }
    memcpy(&g_profiles[profile_id], &g_cfg, sizeof(g_cfg));
    g_profiles[profile_id].hotkey_active = 0U;
    g_profiles[profile_id].aim_active = 0U;
    g_profiles[profile_id].monitor_stream = 0U;
    g_profile_valid_mask |= (uint8_t)(1U << profile_id);
    return 1U;
}

uint8_t MouseBridge_ProfileCommit(void)
{
    uint8_t saved;

    if(g_profile_valid_mask != (uint8_t)((1U << MOUSE_BRIDGE_PROFILE_COUNT) - 1U))
    {
        return 0U;
    }
    saved = BridgeFlash_SaveBank(g_profiles, g_profile_valid_mask, MOUSE_BRIDGE_GUN_AK);
    if(saved)
    {
        MouseBridge_SelectProfileInternal(MOUSE_BRIDGE_GUN_AK, 1U);
    }
    return saved;
}

uint8_t MouseBridge_ProfileSelect(uint8_t profile_id)
{
    return MouseBridge_SelectProfileInternal(profile_id, 1U);
}

void MouseBridge_SetRawDebug(uint8_t enabled)
{
    g_raw_debug = enabled ? 1U : 0U;
}

void MouseBridge_CloneDeviceDescriptor(const uint8_t *src)
{
    (void)src;
}

void MouseBridge_OnParamsChanged(void)
{
    g_cfg.recoil_springback = 1U;
    MouseBridge_ResetRecoilAccum();
    MouseBridge_CancelSpringback();
    MouseBridge_ResetRecoilSession();
    g_recoil_exhausted = 0U;
    g_cfg.hotkey_active = 0;
    if(g_cfg.stage_count == 0U || g_cfg.stage_count > MOUSE_BRIDGE_PROFILE_STAGES)
    {
        g_cfg.stage_count = 1U;
    }
    g_cfg.modify_dx = MouseBridge_RoundX100ToX10(g_cfg.stages[0].dx_x100);
    g_cfg.modify_dy = MouseBridge_RoundX100ToX10(g_cfg.stages[0].dy_x100);

    if(!g_cfg.enabled)
    {
        g_cfg.aim_active = 0;
    }
    MouseBridge_UpdateLed();
}

void MouseBridge_SetReportDescriptor(const uint8_t *src, uint16_t len)
{
    MouseBridge_ApplyDefaultLayout();
    if(src != 0 && len > 0)
    {
        MouseBridge_ParseReportLayout(src, len);
#if (USB_PC_PORT == USB_PC_PORT_USBD)
        USBD_LoadPassthroughReportDescriptor(src, len);
#endif
    }
}

void MouseBridge_UseBootMouseLayout(void)
{
    MouseBridge_ApplyDefaultLayout();
}

