zmsqp/mouse-bridge-ch32/User/mouse_bridge.c
static void MouseBridge_ApplyDefaultLayout(void)
{
    g_layout.report_id = 0;
    g_layout.has_report_id = 0;
    g_layout.btn_bit = 0;
    g_layout.btn_count = 5U;
    g_layout.x_bit = 8;
    g_layout.x_size = 8;
    g_layout.y_bit = 16;
    g_layout.y_size = 8;
    g_layout.wheel_bit = 24;
    g_layout.wheel_size = 8;
    g_layout.payload_len = 4;
}

static uint16_t MouseBridge_HidItemDataSize(uint8_t hdr)
{
    uint8_t sz = hdr & 0x03U;

    if(sz == 3U)
    {
        return 4U;
    }
    return sz;
}

static uint32_t MouseBridge_ReadBits(const uint8_t *p, uint16_t plen, uint16_t bit, uint8_t size)
{
    uint32_t value = 0U;
    uint8_t i;

    if(p == 0 || size == 0U || size > 32U)
    {
        return 0U;
    }

    for(i = 0; i < size; i++)
    {
        uint16_t src_bit = (uint16_t)(bit + i);
        uint16_t byte_pos = (uint16_t)(src_bit >> 3);

        if(byte_pos >= plen)
        {
            break;
        }
        if((p[byte_pos] & (uint8_t)(1U << (src_bit & 0x07U))) != 0U)
        {
            value |= (uint32_t)1U << i;
        }
    }

    return value;
}

static int16_t MouseBridge_ReadSignedBits(const uint8_t *p, uint16_t plen, uint16_t bit, uint8_t size)
{
    uint32_t value;
    uint32_t sign;

    if(size == 0U)
    {
        return 0;
    }
    if(size > 16U)
    {
        size = 16U;
    }

    value = MouseBridge_ReadBits(p, plen, bit, size);
    sign = (uint32_t)1U << (size - 1U);
    if((value & sign) != 0U)
    {
        value |= (~0UL << size);
    }

    return (int16_t)value;
}

static uint8_t MouseBridge_ExtractBootPayload(const uint8_t *payload, uint16_t plen,
                                              uint8_t *btn, int16_t *dx, int16_t *dy, int8_t *wheel)
{
    if(payload == 0 || plen < 3U || btn == 0 || dx == 0 || dy == 0 || wheel == 0)
    {
        return 0U;
    }

    *btn = payload[0];
    *dx = (int8_t)payload[1];
    *dy = (int8_t)payload[2];
    *wheel = (plen >= 4U) ? (int8_t)payload[3] : 0;
    return 1U;
}

static void MouseBridge_ParseReportLayout(const uint8_t *desc, uint16_t len)
{
    uint16_t i = 0;
    uint16_t bit_pos = 0;
    uint8_t report_size = 0;
    uint8_t report_count = 0;
    uint8_t in_mouse_app = 0;
    uint8_t in_ptr_col = 0;
    uint8_t usage_page = 0;
    uint8_t mouse_usage_seen = 0;
    uint8_t usage_min = 0;
    uint8_t usage_max = 0;
    uint8_t has_usage_min = 0;
    uint8_t has_usage_max = 0;
    uint8_t pending_usages[8];
    uint8_t pending_count = 0;

    MouseBridge_ApplyDefaultLayout();

    while(i < len)
    {
        uint8_t hdr = desc[i];
        uint16_t dsz = MouseBridge_HidItemDataSize(hdr);
        uint8_t typ = (hdr >> 2) & 0x03U;
        uint8_t tag = (hdr >> 4) & 0x0FU;
        const uint8_t *dat = &desc[i + 1U];

        if(i + 1U + dsz > len)
        {
            break;
        }

        if(typ == 0x01U)
        {
            /* Global */
            if(tag == 0x0U && dsz >= 1U)
            {
                usage_page = dat[0];
            }
            else if(tag == 0x8U && dsz >= 1U && in_mouse_app)
            {
                g_layout.report_id = dat[0];
                g_layout.has_report_id = 1U;
                bit_pos = 0;
                pending_count = 0;
            }
            else if(tag == 0x7U && dsz >= 1U)
            {
                report_size = dat[0];
            }
            else if(tag == 0x9U && dsz >= 1U)
            {
                report_count = dat[0];
            }
        }
        else if(typ == 0x2U)
        {
            /* Local Usage */
            if(tag == 0x0U && dsz >= 1U)
            {
                if(usage_page == 0x01U && dat[0] == 0x02U)
                {
                    mouse_usage_seen = 1U;
                }
                if(in_mouse_app && pending_count < 8U)
                {
                    pending_usages[pending_count++] = dat[0];
                }
            }
            else if(tag == 0x1U && dsz >= 1U)
            {
                usage_min = dat[0];
                has_usage_min = 1U;
            }
            else if(tag == 0x2U && dsz >= 1U)
            {
                usage_max = dat[0];
                has_usage_max = 1U;
            }
        }
        else if(typ == 0x0U)
        {
            if(tag == 0xAU)
            {
                /* Collection */
                if(dsz >= 1U && dat[0] == 0x01U && mouse_usage_seen)
                {
                    in_mouse_app = 1U;
                    in_ptr_col = 0U;
                    mouse_usage_seen = 0U;
                    bit_pos = 0;
                    pending_count = 0;
                    has_usage_min = 0U;
                    has_usage_max = 0U;
                }
                else if(dsz >= 1U && in_mouse_app && dat[0] == 0x00U)
                {
                    in_ptr_col = 1U;
                    pending_count = 0;
                    has_usage_min = 0U;
                    has_usage_max = 0U;
                }
            }
            else if(tag == 0xC0U)
            {
                if(in_ptr_col)
                {
                    in_ptr_col = 0U;
                }
                else if(in_mouse_app)
                {
                    in_mouse_app = 0U;
                }
                pending_count = 0;
                has_usage_min = 0U;
                has_usage_max = 0U;
            }
            else if(tag == 0x8U && in_mouse_app)
            {
                uint16_t bits = (uint16_t)report_size * (uint16_t)report_count;
                uint8_t u;
                uint8_t is_data = (dsz >= 1U) && ((dat[0] & 0x01U) == 0U);

                if(is_data && bits > 0U)
                {
                    if(usage_page == 0x09U)
                    {
                        uint8_t count = report_count;

                        if(has_usage_min && has_usage_max && usage_min >= 1U && usage_max >= usage_min)
                        {
                            count = (uint8_t)(usage_max - usage_min + 1U);
                            if(count > report_count)
                            {
                                count = report_count;
                            }
                        }
                        else if(pending_count > 0U)
                        {
                            count = pending_count;
                        }

                        if(count > 8U)
                        {
                            count = 8U;
                        }

                        if(count > 0U)
                        {
                            g_layout.btn_bit = bit_pos;
                            g_layout.btn_count = count;
                        }
                    }
                    else if(usage_page == 0x01U)
                    {
                        for(u = 0; u < pending_count && u < report_count; u++)
                        {
                            uint16_t field_bit = (uint16_t)(bit_pos + ((uint16_t)u * report_size));

                            if(pending_usages[u] == 0x30U)
                            {
                                g_layout.x_bit = field_bit;
                                g_layout.x_size = report_size;
                            }
                            else if(pending_usages[u] == 0x31U)
                            {
                                g_layout.y_bit = field_bit;
                                g_layout.y_size = report_size;
                            }
                            else if(pending_usages[u] == 0x38U)
                            {
                                g_layout.wheel_bit = field_bit;
                                g_layout.wheel_size = report_size;
                            }
                        }
                    }
                }

                bit_pos = (uint16_t)(bit_pos + bits);
                pending_count = 0;
                has_usage_min = 0U;
                has_usage_max = 0U;
            }
        }

