zmsqp/mouse-bridge-ch32/User/mouse_bridge.c
        i = (uint16_t)(i + 1U + dsz);
    }

    g_layout.payload_len = (uint8_t)((bit_pos + 7U) / 8U);
    if(g_layout.payload_len < 3U)
    {
        g_layout.payload_len = 4U;
    }
}

static uint8_t MouseBridge_ExtractReport(const uint8_t *raw, uint16_t raw_len,
                                         uint8_t *btn, int16_t *dx, int16_t *dy, int8_t *wheel)
{
    const uint8_t *payload;
    uint16_t plen;

    if(raw == 0 || raw_len == 0U || btn == 0 || dx == 0 || dy == 0 || wheel == 0)
    {
        return 0U;
    }

    if(g_layout.has_report_id)
    {
        if(raw[0] != g_layout.report_id)
        {
            if(raw_len >= 5U &&
               MouseBridge_ExtractBootPayload(raw + 1U, (uint16_t)(raw_len - 1U), btn, dx, dy, wheel))
            {
                g_layout.report_id = raw[0];
                g_layout.btn_bit = 0U;
                g_layout.btn_count = 8U;
                g_layout.x_bit = 8U;
                g_layout.x_size = 8U;
                g_layout.y_bit = 16U;
                g_layout.y_size = 8U;
                g_layout.wheel_bit = 24U;
                g_layout.wheel_size = 8U;
                g_layout.payload_len = 4U;
                return 1U;
            }
            return 0U;
        }
        payload = raw + 1U;
        plen = (uint16_t)(raw_len - 1U);
    }
    else
    {
        payload = raw;
        plen = raw_len;
    }

    if(plen < g_layout.payload_len)
    {
        return MouseBridge_ExtractBootPayload(payload, plen, btn, dx, dy, wheel);
    }

    *btn = (uint8_t)(MouseBridge_ReadBits(payload, plen, g_layout.btn_bit, g_layout.btn_count) & 0xFFU);
    *dx = MouseBridge_ReadSignedBits(payload, plen, g_layout.x_bit, g_layout.x_size);
    *dy = MouseBridge_ReadSignedBits(payload, plen, g_layout.y_bit, g_layout.y_size);
    if(g_layout.wheel_size > 0U)
    {
        *wheel = (int8_t)MouseBridge_ReadSignedBits(payload, plen, g_layout.wheel_bit, g_layout.wheel_size);
    }
    else
    {
        *wheel = 0;
    }

    return 1U;
}

static uint8_t MouseBridge_ExtractButtons(const uint8_t *raw, uint16_t raw_len, uint8_t *btn)
{
    const uint8_t *payload;
    uint16_t plen;

    if(raw == 0 || raw_len == 0U || btn == 0)
    {
        return 0U;
    }

    if(g_layout.has_report_id)
    {
        if(raw[0] != g_layout.report_id)
        {
            return 0U;
        }
        payload = raw + 1U;
        plen = (uint16_t)(raw_len - 1U);
    }
    else
    {
        payload = raw;
        plen = raw_len;
    }

    if(((uint16_t)g_layout.btn_bit + g_layout.btn_count + 7U) / 8U > plen)
    {
        return 0U;
    }

    *btn = (uint8_t)(MouseBridge_ReadBits(payload, plen, g_layout.btn_bit, g_layout.btn_count) & 0xFFU);
    return 1U;
}

static uint8_t MouseBridge_ModifyActive(void)
{
    uint8_t i;

    for(i = 0; i < g_cfg.stage_count && i < MOUSE_BRIDGE_PROFILE_STAGES; i++)
    {
        if(g_cfg.stages[i].dx_x100 != 0 || g_cfg.stages[i].dy_x100 != 0)
        {
            return 1U;
        }
    }
    return 0U;
}

void MouseBridge_OnHostReady(void)
{
    BridgeDebug_LogMouseReady(0, g_pc_ep_max, g_layout.report_id);
#if BRIDGE_DEBUG_UART && MOUSE_BRIDGE_VERBOSE_LAYOUT
    printf("[Host] layout rid=%u btnbit=%u/%u xbit=%u/%u ybit=%u/%u wbit=%u/%u pay=%u\r\n",
           g_layout.has_report_id ? (unsigned)g_layout.report_id : 0U,
           (unsigned)g_layout.btn_bit, (unsigned)g_layout.btn_count,
           (unsigned)g_layout.x_bit, (unsigned)g_layout.x_size,
           (unsigned)g_layout.y_bit, (unsigned)g_layout.y_size,
           (unsigned)g_layout.wheel_bit, (unsigned)g_layout.wheel_size,
           (unsigned)g_layout.payload_len);
#endif
}

void MouseBridge_SetEndpointParams(uint16_t max_packet, uint8_t interval)
{
    (void)interval;

    if(max_packet == 0)
    {
        max_packet = 4;
    }
    if(max_packet > MOUSE_BRIDGE_REPORT_MAX)
    {
        max_packet = MOUSE_BRIDGE_REPORT_MAX;
    }

    g_host_ep_max = max_packet;
}

void MouseBridge_BuildConfigDescriptor(void)
{
}

static void MouseBridge_ResetRecoilAccum(void)
{
    g_dx_accum_x100 = 0;
    g_dy_accum_x100 = 0;
}

static void MouseBridge_DropPendingInject(void)
{
    /*
     * Only motion accepted by the PC may be undone.  Remove compensation that
     * is still waiting on the synthetic endpoint before taking the anchor
     * snapshot, otherwise release can first flush one last downward packet.
     */
    g_motion_dx = (int16_t)(g_motion_dx - g_pending_inject_dx);
    g_motion_dy = (int16_t)(g_motion_dy - g_pending_inject_dy);
    g_pending_inject_dx = 0;
    g_pending_inject_dy = 0;
    if(g_motion_dx == 0 && g_motion_dy == 0 && g_out_wheel == 0)
    {
        g_motion_dirty = 0U;
    }
}

static void MouseBridge_CancelSpringback(void)
{
    if(g_springback_active)
    {
        /* Queued springback belongs to the cancelled session. */
        g_motion_dx = 0;
        g_motion_dy = 0;
        if(g_out_wheel == 0)
        {
            g_motion_dirty = 0U;
        }
    }
    g_springback_active = 0U;
}

static void MouseBridge_ResetRecoilSession(void)
{
    MouseBridge_DropPendingInject();
    g_session_inject_dx = 0;
    g_session_inject_dy = 0;
    g_recoil_start_ms = 0;
    g_recoil_stage_index = 0;
    g_inject_div = 0;
    MouseBridge_ResetRecoilAccum();
}

static uint8_t MouseBridge_SelectProfileInternal(uint8_t profile_id, uint8_t notify)
{
    uint8_t enabled;
    uint8_t monitor;
    uint8_t was_aim;

    if(profile_id >= MOUSE_BRIDGE_PROFILE_COUNT ||
       (g_profile_valid_mask & (uint8_t)(1U << profile_id)) == 0U)
    {
        return 0U;
    }

    enabled = g_cfg.enabled;
    monitor = g_cfg.monitor_stream;
    was_aim = g_cfg.aim_active;
    if(g_session_inject_dx != 0 || g_session_inject_dy != 0 ||
       g_pending_inject_dx != 0 || g_pending_inject_dy != 0)
    {
        MouseBridge_StartSpringback();
    }
    else
    {
        MouseBridge_ResetRecoilSession();
    }

    memcpy(&g_cfg, &g_profiles[profile_id], sizeof(g_cfg));
    g_cfg.enabled = enabled;
    g_cfg.monitor_stream = monitor;
    g_cfg.recoil_springback = 1U;
    g_cfg.hotkey_active = 0U;
    /* Every gun change is deliberately disarmed; front side must be pressed once. */
    g_cfg.aim_active = 0U;
    g_selected_profile = profile_id;
    MouseBridge_ResetRecoilAccum();
    g_recoil_start_ms = 0U;
    g_recoil_stage_index = 0U;
    g_recoil_exhausted = 0U;
    MouseBridge_UpdateLed();
    LED_Indicator_PulseSelection();

    if(notify)
    {
        MouseBridge_NotifyProfileChange();
        if(was_aim) MouseBridge_NotifyAimChange();
    }
    return 1U;
}

static int16_t MouseBridge_SatAdd16(int16_t base, int8_t delta)
{
    int32_t sum = (int32_t)base + (int32_t)delta;
    if(sum > 32767)
    {
        return 32767;
    }
    if(sum < -32768)
    {
        return (int16_t)(-32768);
    }
    return (int16_t)sum;
}

static void MouseBridge_TrackSessionInject(int8_t dx, int8_t dy)
{
    g_session_inject_dx = MouseBridge_SatAdd16(g_session_inject_dx, dx);
    g_session_inject_dy = MouseBridge_SatAdd16(g_session_inject_dy, dy);
}

static void MouseBridge_StartSpringback(void)
{
    int16_t return_dx;
    int16_t return_dy;

    if(g_springback_active)
    {
        return;
    }
    g_cfg.hotkey_active = 0;
    MouseBridge_DropPendingInject();

    if(g_session_inject_dx == 0 && g_session_inject_dy == 0)
    {
        return;
    }

