zmsqp/mouse-bridge-ch32/User/mouse_bridge.c
    /*
     * This is an anchor reset, not a recoil-recovery animation.  Queue the
     * complete inverse displacement in the button-release event itself.  USB
     * can split it into signed 8-bit reports, but no easing/delay is allowed:
     * the destination is the left-button-down firing coordinate.
     */
    return_dx = (g_session_inject_dx == (int16_t)-32768) ? 32767 : (int16_t)(-g_session_inject_dx);
    return_dy = (g_session_inject_dy == (int16_t)-32768) ? 32767 : (int16_t)(-g_session_inject_dy);
    g_session_inject_dx = 0;
    g_session_inject_dy = 0;
    g_springback_active = 1U;
    g_inject_div = 0;
    g_cfg.hotkey_active = 0;
    MouseBridge_ResetRecoilAccum();
    MouseBridge_AccumMotion(return_dx, return_dy, 0U, 0, 0U);
}

static void MouseBridge_TickSpringback(void)
{
    if(!g_springback_active)
    {
        return;
    }

    /* Full reset was queued at release; only wait for USB to drain it. */
    if(g_motion_dx == 0 && g_motion_dy == 0)
    {
        g_springback_active = 0U;
    }
}

static void MouseBridge_ClearReportBits(uint8_t *raw, uint16_t raw_len,
                                        uint16_t first_bit, uint8_t count)
{
    uint8_t *payload = raw;
    uint16_t payload_len = raw_len;
    uint8_t i;

    if(g_layout.has_report_id)
    {
        if(raw_len < 2U || raw[0] != g_layout.report_id) return;
        payload = raw + 1U;
        payload_len--;
    }
    for(i = 0; i < count; i++)
    {
        uint16_t bit = (uint16_t)(first_bit + i);
        uint16_t byte_pos = (uint16_t)(bit >> 3);
        if(byte_pos >= payload_len) break;
        payload[byte_pos] &= (uint8_t)~(1U << (bit & 0x07U));
    }
}

static void MouseBridge_ScrubControlReport(uint8_t *raw, uint16_t raw_len,
                                           uint8_t buttons, int8_t wheel)
{
    uint8_t suppress = (uint8_t)(BUTTON_FRONT_MASK | g_suppressed_buttons);
    uint8_t i;

    if((buttons & BUTTON_MIDDLE_MASK) != 0U) suppress |= BUTTON_MIDDLE_MASK;
    for(i = 0; i < g_layout.btn_count && i < 8U; i++)
    {
        if((suppress & (uint8_t)(1U << i)) != 0U)
        {
            MouseBridge_ClearReportBits(raw, raw_len, (uint16_t)(g_layout.btn_bit + i), 1U);
        }
    }
    if((buttons & BUTTON_MIDDLE_MASK) != 0U && wheel != 0 && g_layout.wheel_size > 0U)
    {
        MouseBridge_ClearReportBits(raw, raw_len, g_layout.wheel_bit, g_layout.wheel_size);
    }
}

static void MouseBridge_HandleButtons(uint8_t buttons, int8_t wheel)
{
    uint8_t lbtn = (uint8_t)(buttons & BUTTON_LEFT_MASK);
    uint8_t aim_btn;
    uint8_t middle = (uint8_t)(buttons & BUTTON_MIDDLE_MASK);
    uint8_t middle_rising = (uint8_t)(middle && !(g_control_prev_buttons & BUTTON_MIDDLE_MASK));
    uint8_t selector_mask = 0U;
    uint8_t requested_profile = 0xFFU;
    uint32_t now = BridgeTime_GetMs();
    uint8_t aim_debounce_ok = (g_last_aim_toggle_ms == 0U ||
                               (now - g_last_aim_toggle_ms) >= AIM_TOGGLE_DEBOUNCE_MS);

    g_aim_button_mask = AIM_TOGGLE_DEFAULT_MASK;
    g_suppressed_buttons &= buttons;
    aim_btn = (uint8_t)((buttons & AIM_TOGGLE_DEFAULT_MASK) ? 1U : 0U);
    if(middle)
    {
        if((buttons & BUTTON_FRONT_MASK) &&
           (middle_rising || !(g_control_prev_buttons & BUTTON_FRONT_MASK)))
        {
            requested_profile = MOUSE_BRIDGE_GUN_AK;
            selector_mask = BUTTON_FRONT_MASK;
        }
        else if((buttons & BUTTON_REAR_MASK) &&
                (middle_rising || !(g_control_prev_buttons & BUTTON_REAR_MASK)))
        {
            requested_profile = MOUSE_BRIDGE_GUN_PHANTOM;
            selector_mask = BUTTON_REAR_MASK;
        }
        else if((buttons & BUTTON_LEFT_MASK) &&
                (middle_rising || !(g_control_prev_buttons & BUTTON_LEFT_MASK)))
        {
            requested_profile = MOUSE_BRIDGE_GUN_ARES;
            selector_mask = BUTTON_LEFT_MASK;
        }
        else if((buttons & BUTTON_RIGHT_MASK) &&
                (middle_rising || !(g_control_prev_buttons & BUTTON_RIGHT_MASK)))
        {
            requested_profile = MOUSE_BRIDGE_GUN_ODIN;
            selector_mask = BUTTON_RIGHT_MASK;
        }
        else if(wheel > 0)
        {
            requested_profile = MOUSE_BRIDGE_GUN_SPECTRE;
        }
        else if(wheel < 0)
        {
            requested_profile = MOUSE_BRIDGE_GUN_BULLDOG;
        }

        g_suppressed_buttons |= (uint8_t)(BUTTON_MIDDLE_MASK | selector_mask);
        if(requested_profile != 0xFFU)
        {
            MouseBridge_SelectProfileInternal(requested_profile, 1U);
        }
    }
    else if(aim_btn && !g_aim_btn_was_down && aim_debounce_ok)
    {
        g_cfg.aim_active = g_cfg.aim_active ? 0U : 1U;
        g_last_aim_toggle_ms = now;
        MouseBridge_NotifyAimChange();
        MouseBridge_UpdateLed();
    }

    g_aim_btn_was_down = aim_btn;
    g_control_prev_buttons = buttons;

    if(lbtn && !g_lbtn_was_down)
    {
        g_lbtn_down_ms = now;
        g_recoil_exhausted = 0U;
    }
    else if(!lbtn && g_lbtn_was_down)
    {
        /* 左键松开当帧停补并回退，不等 1ms 定时器。 */
        if(g_cfg.enabled && g_cfg.aim_active &&
           (g_session_inject_dx != 0 || g_session_inject_dy != 0 ||
            g_pending_inject_dx != 0 || g_pending_inject_dy != 0))
        {
            uint8_t was_active = g_cfg.hotkey_active;
            MouseBridge_StartSpringback();
            if(was_active != g_cfg.hotkey_active)
            {
                MouseBridge_NotifyHotkeyChange();
                MouseBridge_UpdateLed();
            }
        }
    }

    g_lbtn_was_down = lbtn;
    g_current_buttons = buttons;
}

static void MouseBridge_TickRecoilLogic(void)
{
    uint8_t lbtn = (uint8_t)(g_current_buttons & 0x01U);
    uint8_t prev_active = g_cfg.hotkey_active;
    uint32_t now = BridgeTime_GetMs();

    if(!g_cfg.aim_active)
    {
        g_cfg.hotkey_active = 0;
        MouseBridge_CancelSpringback();
        MouseBridge_ResetRecoilSession();
    }
    else if(lbtn)
    {
        uint32_t held = now - g_lbtn_down_ms;

