zmsqp/mouse-bridge-ch32/User/mouse_bridge.c
        if(g_recoil_exhausted)
        {
            /* A finished magazine stays stopped until the trigger is released. */
            g_cfg.hotkey_active = 0U;
        }
        else if(g_springback_active)
        {
            g_cfg.hotkey_active = 0;
        }
        else if(held >= g_cfg.hotkey_hold_ms)
        {
            g_cfg.hotkey_active = MouseBridge_ModifyActive() ? 1U : 0U;
        }
        else
        {
            g_cfg.hotkey_active = 0U;
        }

        if(g_cfg.hotkey_active && !prev_active)
        {
            MouseBridge_CancelSpringback();
            MouseBridge_ResetRecoilSession();
        }

        /* 弹匣轨迹走完即回正；即使左键仍按住，也不能停在压低位置。 */
        if(g_cfg.hotkey_active && g_recoil_start_ms != 0U)
        {
            if(MouseBridge_CurrentStage() == &g_zero_stage)
            {
                g_recoil_exhausted = 1U;
                g_cfg.hotkey_active = 0U;
                MouseBridge_ResetRecoilAccum();
                MouseBridge_StartSpringback();
            }
        }
    }
    else
    {
        if(prev_active && !g_springback_active)
        {
            MouseBridge_StartSpringback();
        }
        g_cfg.hotkey_active = 0;
        g_recoil_exhausted = 0U;
    }

    if(g_cfg.hotkey_active != prev_active)
    {
        MouseBridge_NotifyHotkeyChange();
        MouseBridge_UpdateLed();
    }
}

static int8_t MouseBridge_ClampAxis(int16_t value)
{
    if(value > 127)
    {
        return 127;
    }
    if(value < -127)
    {
        return -127;
    }
    return (int8_t)value;
}

static int8_t MouseBridge_CommitSentInjectAxis(int8_t sent, int16_t *pending)
{
    int16_t used;

    if((sent > 0 && *pending <= 0) || (sent < 0 && *pending >= 0) || sent == 0)
    {
        return 0;
    }

    used = sent;
    if(*pending > 0 && used > *pending)
    {
        used = *pending;
    }
    else if(*pending < 0 && used < *pending)
    {
        used = *pending;
    }
    *pending = (int16_t)(*pending - used);
    return (int8_t)used;
}

static int8_t MouseBridge_ConsumeModifyStep(int16_t modify_x100, int16_t *accum)
{
    int8_t step = 0;

    if(modify_x100 == 0)
    {
        return 0;
    }

    if(modify_x100 > MOUSE_BRIDGE_STAGE_AXIS_MAX_X100)
    {
        modify_x100 = MOUSE_BRIDGE_STAGE_AXIS_MAX_X100;
    }
    if(modify_x100 < -MOUSE_BRIDGE_STAGE_AXIS_MAX_X100)
    {
        modify_x100 = -MOUSE_BRIDGE_STAGE_AXIS_MAX_X100;
    }

    *accum += modify_x100;
    while(*accum >= 100)
    {
        step++;
        *accum = (int16_t)(*accum - 100);
    }
    while(*accum <= -100)
    {
        step--;
        *accum = (int16_t)(*accum + 100);
    }

    return step;
}

static uint8_t MouseBridge_TrailingStagesIdle(uint8_t first)
{
    uint8_t i;

    for(i = first; i < g_cfg.stage_count && i < MOUSE_BRIDGE_PROFILE_STAGES; i++)
    {
        if(g_cfg.stages[i].dx_x100 != 0 || g_cfg.stages[i].dy_x100 != 0)
        {
            return 0U;
        }
    }
    return 1U;
}

static const MouseBridgeStage *MouseBridge_CurrentStage(void)
{
    uint32_t elapsed;
    uint32_t sum = 0U;
    uint8_t i;

    if(g_cfg.stage_count == 0U || g_cfg.stage_count > MOUSE_BRIDGE_PROFILE_STAGES)
    {
        g_cfg.stage_count = 1U;
    }

    if(g_recoil_start_ms == 0U)
    {
        g_recoil_start_ms = BridgeTime_GetMs();
        g_recoil_stage_index = 0U;
    }

    elapsed = BridgeTime_GetMs() - g_recoil_start_ms;
    for(i = 0; i < g_cfg.stage_count; i++)
    {
        uint16_t dur = g_cfg.stages[i].duration_ms;

        if(dur == 0U)
        {
            g_recoil_stage_index = i;
            if(g_cfg.stage_count == 1U)
            {
                return &g_cfg.stages[i];
            }
            return &g_zero_stage;
        }
        sum += dur;
        if(elapsed < sum)
        {
            g_recoil_stage_index = i;
            /*
             * Generated profiles can contain an all-zero tail covering the
             * post-fire video.  Treat the first such tail stage as magazine
             * end instead of waiting while the game's recoil falls downward.
             */
            if(g_cfg.stage_count > 1U &&
               MouseBridge_TrailingStagesIdle(i))
            {
                return &g_zero_stage;
            }
            return &g_cfg.stages[i];
        }
    }

    g_recoil_stage_index = (uint8_t)(g_cfg.stage_count - 1U);
    return &g_zero_stage;
}

static void MouseBridge_StreamReport(uint8_t buttons, int16_t dx, int16_t dy, int8_t wheel)
{
    uint32_t now;

    if(!g_cfg.monitor_stream)
    {
        return;
    }

    now = BridgeTime_GetMs();
    if((now - g_stream_last_ms) < 50U)
    {
        return;
    }
    g_stream_last_ms = now;

    printf("@M,%u,%d,%d,%d,%u,%u\r\n",
           (unsigned)buttons,
           (int)MouseBridge_ClampAxis(dx),
           (int)MouseBridge_ClampAxis(dy),
           (int)wheel,
           (unsigned)g_cfg.hotkey_active,
           (unsigned)g_cfg.aim_active);
}

static void MouseBridge_AccumMotion(int16_t dx, int16_t dy, uint8_t buttons, int8_t wheel, uint8_t update_wheel)
{
    g_motion_dx += dx;
    g_motion_dy += dy;
    g_out_buttons = buttons;
    if(update_wheel && wheel != 0)
    {
        g_out_wheel = (int16_t)(g_out_wheel + wheel);
        if(g_pending_wheel_reports < 255U)
        {
            g_pending_wheel_reports++;
        }
    }
    g_motion_dirty = 1U;
    MouseBridge_TryFlush();
}

static uint8_t MouseBridge_UsbReady(void)
{
#if (USB_PC_PORT == USB_PC_PORT_USBFS)
    return USBFS_DevEnumStatus ? 1U : 0U;
#else
    return (bDeviceState == CONFIGURED) ? 1U : 0U;
#endif
}

static uint8_t MouseBridge_EndpBusy(void)
{
#if (USB_PC_PORT == USB_PC_PORT_USBFS)
    return USBFS_Endp_Busy[DEF_UEP2] ? 1U : 0U;
#else
    return USBD_Endp2_Busy ? 1U : 0U;
#endif
}

static uint8_t MouseBridge_SendPacket(const uint8_t *buf, uint16_t len)
{
#if (USB_PC_PORT == USB_PC_PORT_USBFS)
    if(USBFS_Endp_DataUp(DEF_UEP2, (uint8_t *)buf, len, DEF_UEP_CPY_LOAD) == 0)
    {
        return 1U;
    }
    return 0U;
#else
    return (USBD_ENDPx_DataUp(ENDP2, (uint8_t *)buf, len) == USB_SUCCESS) ? 1U : 0U;
#endif
}

static uint8_t MouseBridge_RawEndpBusy(void)
{
#if (USB_PC_PORT == USB_PC_PORT_USBFS)
    return USBFS_Endp_Busy[DEF_UEP2] ? 1U : 0U;
#else
    return USBD_Endp1_Busy ? 1U : 0U;
#endif
}

static uint8_t MouseBridge_SendRawPacket(const uint8_t *buf, uint16_t len)
{
#if (USB_PC_PORT == USB_PC_PORT_USBFS)
    if(USBFS_Endp_DataUp(DEF_UEP2, (uint8_t *)buf, len, DEF_UEP_CPY_LOAD) == 0)
    {
        return 1U;
    }
    return 0U;
#else
    return (USBD_ENDPx_DataUp(ENDP1, (uint8_t *)buf, len) == USB_SUCCESS) ? 1U : 0U;
#endif
}

