zmsqp/mouse-bridge-ch32/User/mouse_bridge.c
static void MouseBridge_TryFlushRaw(void)
{
    if(!MouseBridge_UsbReady() || MouseBridge_RawEndpBusy())
    {
        return;
    }

    while(g_raw_q_count > 0U && !MouseBridge_RawEndpBusy())
    {
        if(!MouseBridge_SendRawPacket(g_raw_queue[g_raw_q_read], g_raw_queue_len[g_raw_q_read]))
        {
            break;
        }

        g_raw_q_read = (uint8_t)((g_raw_q_read + 1U) % MOUSE_BRIDGE_RAW_QUEUE_SIZE);
        g_raw_q_count--;
    }
}

static void MouseBridge_TryForwardRaw(const uint8_t *data, uint16_t len)
{
    if(data == 0 || len == 0U)
    {
        return;
    }

    if(len > MOUSE_BRIDGE_REPORT_MAX)
    {
        len = MOUSE_BRIDGE_REPORT_MAX;
    }

    MouseBridge_TryFlushRaw();
    if(g_raw_q_count == 0U && MouseBridge_UsbReady() && !MouseBridge_RawEndpBusy())
    {
        if(MouseBridge_SendRawPacket(data, len))
        {
            return;
        }
    }

    if(g_raw_q_count >= MOUSE_BRIDGE_RAW_QUEUE_SIZE)
    {
        g_raw_q_read = (uint8_t)((g_raw_q_read + 1U) % MOUSE_BRIDGE_RAW_QUEUE_SIZE);
        g_raw_q_count--;
    }

    memcpy(g_raw_queue[g_raw_q_write], data, len);
    g_raw_queue_len[g_raw_q_write] = len;
    g_raw_q_write = (uint8_t)((g_raw_q_write + 1U) % MOUSE_BRIDGE_RAW_QUEUE_SIZE);
    g_raw_q_count++;
}

static void MouseBridge_TryFlush(void)
{
    uint8_t pkt[MOUSE_BRIDGE_REPORT_MAX];
    uint16_t len;
    int8_t sdx;
    int8_t sdy;
    int8_t swheel;
    int8_t inject_dx;
    int8_t inject_dy;

    if(!g_motion_dirty || !MouseBridge_UsbReady())
    {
        return;
    }

    len = g_pc_ep_max;
    if(len < 3U)
    {
        return;
    }

    while(g_motion_dirty && !MouseBridge_EndpBusy())
    {
        sdx = MouseBridge_ClampAxis(g_motion_dx);
        sdy = MouseBridge_ClampAxis(g_motion_dy);
        swheel = (len >= 4U) ? MouseBridge_ClampAxis(g_out_wheel) : 0;

        if(sdx == 0 && sdy == 0 &&
           g_out_buttons == g_last_sent_buttons &&
           swheel == 0)
        {
            g_motion_dirty = 0U;
            break;
        }

        pkt[0] = (uint8_t)sdx;
        pkt[1] = (uint8_t)sdy;
        pkt[2] = (uint8_t)swheel;
        if(len >= 4U)
        {
            pkt[3] = 0U;
        }

        if(!MouseBridge_SendPacket(pkt, len))
        {
            BridgeDebug_LogForward(pkt, len, 0U);
            break;
        }

        BridgeDebug_LogForward(pkt, len, 1U);

        inject_dx = MouseBridge_CommitSentInjectAxis(sdx, &g_pending_inject_dx);
        inject_dy = MouseBridge_CommitSentInjectAxis(sdy, &g_pending_inject_dy);
        if(inject_dx != 0 || inject_dy != 0)
        {
            MouseBridge_TrackSessionInject(inject_dx, inject_dy);
        }

        g_motion_dx = (int16_t)(g_motion_dx - sdx);
        g_motion_dy = (int16_t)(g_motion_dy - sdy);
        g_last_sent_buttons = g_out_buttons;
        if(len >= 4U)
        {
            g_out_wheel = (int16_t)(g_out_wheel - swheel);
            if(swheel != 0 && g_pending_wheel_reports > 0U)
            {
                g_pending_wheel_reports--;
            }
        }

        MouseBridge_StreamReport(g_out_buttons, sdx, sdy, swheel);

        if(g_motion_dx == 0 && g_motion_dy == 0 &&
           g_out_buttons == g_last_sent_buttons &&
           (len < 4U || g_out_wheel == 0))
        {
            g_motion_dirty = 0U;
        }
    }
}

static void MouseBridge_DispatchReport(uint8_t buttons, int16_t dx, int16_t dy, int8_t wheel, uint8_t from_host)
{
    uint8_t out_buttons = buttons;

    if(from_host)
    {
        if(g_cfg.enabled)
        {
            MouseBridge_HandleButtons(buttons, wheel);
            out_buttons = (uint8_t)(buttons & (uint8_t)~g_aim_button_mask);
        }
        else
        {
            g_current_buttons = buttons;
        }
        g_forward_buttons = out_buttons;
    }

    MouseBridge_AccumMotion(dx, dy, out_buttons, wheel, 1U);

    if(from_host && g_cfg.monitor_stream)
    {
        MouseBridge_StreamReport(buttons, dx, dy, wheel);
    }
}

static void MouseBridge_InjectRecoil(void)
{
    uint32_t now;
    int8_t dx;
    int8_t dy;
    const MouseBridgeStage *stage;

    if(g_springback_active)
    {
        return;
    }

    if(!g_cfg.enabled || !g_cfg.hotkey_active || !MouseBridge_ModifyActive())
    {
        return;
    }

    now = BridgeTime_GetMs();
    if((now - g_last_inject_ms) < RECOIL_INJECT_INTERVAL_MS)
    {
        return;
    }
#if (USB_PC_PORT == USB_PC_PORT_USBFS)
    /* USBFS shares the endpoint; wait until raw reports drain there. */
    if(g_raw_q_count > 0U)
    {
        return;
    }
#endif

    g_last_inject_ms = now;
    stage = MouseBridge_CurrentStage();
    dx = MouseBridge_ConsumeModifyStep(stage->dx_x100, &g_dx_accum_x100);
    dy = MouseBridge_ConsumeModifyStep(stage->dy_x100, &g_dy_accum_x100);
    if(dx == 0 && dy == 0)
    {
        return;
    }
    g_pending_inject_dx = MouseBridge_SatAdd16(g_pending_inject_dx, dx);
    g_pending_inject_dy = MouseBridge_SatAdd16(g_pending_inject_dy, dy);
    MouseBridge_AccumMotion(dx, dy, 0U, 0, 0U);
}

void MouseBridge_OnTimer1ms(void)
{
    MouseBridge_TryFlushRaw();
    MouseBridge_TickRecoilLogic();

    if(g_springback_active)
    {
        /* Full anchor reset is already queued; finish its USB packets first. */
        MouseBridge_TickSpringback();
    }
    else if(!g_springback_active && g_cfg.hotkey_active && g_recoil_start_ms == 0U)
    {
        MouseBridge_InjectRecoil();
    }
    else
    {
        g_inject_div++;
        if(g_inject_div >= RECOIL_INJECT_INTERVAL_MS)
        {
            g_inject_div = 0;
            MouseBridge_InjectRecoil();
        }
    }

    MouseBridge_TryFlushRaw();
    MouseBridge_TryFlush();
}

void MouseBridge_ForwardReport(const uint8_t *data, uint16_t len)
{
    uint8_t buttons;
    int16_t dx;
    int16_t dy;
    int8_t wheel;
    uint8_t parsed;
    uint8_t forwarded[MOUSE_BRIDGE_REPORT_MAX];
    uint16_t forwarded_len;

    if(data == 0 || len == 0)
    {
        return;
    }

    if(!g_cfg.enabled && !g_raw_debug)
    {
        MouseBridge_TryForwardRaw(data, len);
        return;
    }

    buttons = 0U;
    dx = 0;
    dy = 0;
    wheel = 0;
    parsed = MouseBridge_ExtractReport(data, len, &buttons, &dx, &dy, &wheel);
    if(!parsed)
    {
        parsed = MouseBridge_ExtractButtons(data, len, &buttons);
    }

    if(!parsed)
    {
        MouseBridge_TryForwardRaw(data, len);
        MouseBridge_LogRawReport(data, len, 0U, 0U, 0, 0, 0);
        BridgeDebug_LogDrop("parse", data, len);
        return;
    }

    MouseBridge_LogRawReport(data, len, 1U, buttons, dx, dy, wheel);
    if(g_cfg.enabled)
    {
        MouseBridge_HandleButtons(buttons, wheel);
        forwarded_len = (len > MOUSE_BRIDGE_REPORT_MAX) ? MOUSE_BRIDGE_REPORT_MAX : len;
        memcpy(forwarded, data, forwarded_len);
        MouseBridge_ScrubControlReport(forwarded, forwarded_len, buttons, wheel);
        MouseBridge_TryForwardRaw(forwarded, forwarded_len);
    }
    else
    {
        g_current_buttons = buttons;
        MouseBridge_TryForwardRaw(data, len);
    }
    g_forward_buttons = buttons;
}

void MouseBridge_Poll(void)
{
    MouseBridge_TryFlushRaw();
    MouseBridge_TryFlush();
}
